witalis3/UA3REO-DDC-Transceiver/STM32/Src/peripheral.c
#include "stm32h7xx_hal.h"
#include "main.h"
#include "peripheral.h"
#include "lcd.h"
#include "trx_manager.h"
#include "agc.h"
#include "settings.h"
#include "system_menu.h"
#include "functions.h"
#include "audio_filters.h"

static bool PERIPH_SPI_busy = false;
static bool FRONTPanel_MCP3008_1_Enabled = true;
static bool FRONTPanel_MCP3008_2_Enabled = true;
	
static uint8_t ENCODER_ALast = 0;
static uint8_t ENCODER_AVal = 0;
static int32_t ENCODER_slowler = 0;
static uint8_t ENCODER2_ALast = 0;
static uint8_t ENCODER2_AVal = 0;
static bool ENCODER2_SWLast = true;

volatile PERIPH_FrontPanel_Type PERIPH_FrontPanel = { 0 };

static void PERIPH_ENCODER_Rotated(int direction);
static void PERIPH_ENCODER2_Rotated(int direction);
static uint16_t PERIPH_ReadMCP3008_Value(uint8_t channel, GPIO_TypeDef* CS_PORT, uint16_t CS_PIN);
	
void PERIPH_ENCODER_checkRotate(void) {
	ENCODER_AVal = HAL_GPIO_ReadPin(ENC_CLK_GPIO_Port, ENC_CLK_Pin);
	if( ENCODER_ALast != ENCODER_AVal)
	{
		ENCODER_ALast = ENCODER_AVal;
		if (ENCODER_AVal != HAL_GPIO_ReadPin(ENC_DT_GPIO_Port, ENC_DT_Pin)) {  // Если вывод A изменился первым - вращение по часовой стрелке
			ENCODER_slowler--;
			if (ENCODER_slowler < -TRX.ENCODER_SLOW_RATE)
			{
				PERIPH_ENCODER_Rotated(ENCODER_INVERT ? 1 : -1);
				ENCODER_slowler = 0;
			}
		}
		else {// иначе B изменил свое состояние первым - вращение против часовой стрелки
			ENCODER_slowler++;
			if (ENCODER_slowler > TRX.ENCODER_SLOW_RATE)
			{
				PERIPH_ENCODER_Rotated(ENCODER_INVERT ? -1 : 1);
				ENCODER_slowler = 0;
			}
		}
	}
}

void PERIPH_ENCODER2_checkRotate(void) {
	ENCODER2_AVal = HAL_GPIO_ReadPin(ENC2_CLK_GPIO_Port, ENC2_CLK_Pin);
	if( ENCODER2_ALast != ENCODER2_AVal)
	{
		ENCODER2_ALast = ENCODER2_AVal;
		if (ENCODER2_AVal != HAL_GPIO_ReadPin(ENC2_DT_GPIO_Port, ENC2_DT_Pin)) {  // Если вывод A изменился первым - вращение по часовой стрелке
			PERIPH_ENCODER2_Rotated(ENCODER2_INVERT ? 1 : -1);
		}
		else {// иначе B изменил свое состояние первым - вращение против часовой стрелки
			PERIPH_ENCODER2_Rotated(ENCODER2_INVERT ? -1 : 1);
		}
	}
}

static void PERIPH_ENCODER_Rotated(int direction) //энкодер повернули, здесь обработчик, direction -1 - влево, 1 - вправо
{
	TRX_Time_InActive = 0;
	if(TRX.Locked) return;
	
	if (LCD_systemMenuOpened && !LCD_timeMenuOpened)
	{
		eventRotateSystemMenu(direction);
		return;
	}
	if (!LCD_timeMenuOpened)
	{
		VFO* vfo=CurrentVFO();
		if (TRX.Fast)
		{
			TRX_setFrequency(TRX_getFrequency(vfo) + 100 * direction, vfo);
			if((TRX_getFrequency(vfo) % 100) > 0)
				TRX_setFrequency(TRX_getFrequency(vfo)/100*100, vfo);
		}
		else
		{
			TRX_setFrequency(TRX_getFrequency(vfo) + 10 * direction, vfo);
			if((TRX_getFrequency(vfo) % 10) > 0)
				TRX_setFrequency(TRX_getFrequency(vfo)/10*10, vfo);
		}
		LCD_UpdateQuery.FreqInfo = true;
	}
	if (LCD_timeMenuOpened)
	{
		uint32_t Time = RTC->TR;
		RTC_TimeTypeDef sTime;
		sTime.TimeFormat = RTC_HOURFORMAT12_PM;
		sTime.SubSeconds = 0;
		sTime.SecondFraction = 0;
		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
		sTime.StoreOperation = RTC_STOREOPERATION_SET;
		sTime.Hours = (uint8_t)(((Time >> 20) & 0x03) * 10 + ((Time >> 16) & 0x0f));
		sTime.Minutes = (uint8_t)(((Time >> 12) & 0x07) * 10 + ((Time >> 8) & 0x0f));
		sTime.Seconds = (uint8_t)(((Time >> 4) & 0x07) * 10 + ((Time >> 0) & 0x0f));
		if (TimeMenuSelection == 0)
		{
			if (sTime.Hours == 0 && direction < 0) return;
			sTime.Hours = sTime.Hours + direction;
		}
		if (TimeMenuSelection == 1)
		{
			if (sTime.Minutes == 0 && direction < 0) return;
			sTime.Minutes = sTime.Minutes + direction;
		}
		if (TimeMenuSelection == 2)
		{
			if (sTime.Seconds == 0 && direction < 0) return;
			sTime.Seconds = sTime.Seconds + direction;
		}
		if (sTime.Hours >= 24) sTime.Hours = 0;
		if (sTime.Minutes >= 60) sTime.Minutes = 0;
		if (sTime.Seconds >= 60) sTime.Seconds = 0;
		HAL_RTC_DeInit(&hrtc);
		HAL_RTC_Init(&hrtc);
		HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
		LCD_UpdateQuery.SystemMenu = true;
		return;
	}
	NeedSaveSettings = true;
}

static void PERIPH_ENCODER2_Rotated(int direction) //энкодер повернули, здесь обработчик, direction -1 - влево, 1 - вправо
{
	TRX_Time_InActive = 0;
	if(TRX.Locked) return;
	
	if (LCD_systemMenuOpened || LCD_timeMenuOpened)
	{
		eventSecRotateSystemMenu(direction);
		return;
	}
	
	//NOTCH - default action
	if(TRX.NotchFilter)
	{
		if (TRX.NotchFC > 50 && direction < 0)
			TRX.NotchFC -= 25;
		else if (TRX.NotchFC < CurrentVFO()->Filter_Width && direction > 0)
			TRX.NotchFC += 25;
		LCD_UpdateQuery.StatusInfoGUI = true;
		NeedReinitNotch = true;
	}
	else
	{
		VFO* vfo=CurrentVFO();
		if (TRX.Fast)
		{
			TRX_setFrequency(TRX_getFrequency(vfo) + 100000 * direction, vfo);
			if((TRX_getFrequency(vfo) % 100000) > 0)
				TRX_setFrequency(TRX_getFrequency(vfo)/100000*100000, vfo);
		}
		else
		{
			TRX_setFrequency(TRX_getFrequency(vfo) + 25000 * direction, vfo);
			if((TRX_getFrequency(vfo) % 25000) > 0)
				TRX_setFrequency(TRX_getFrequency(vfo)/25000*25000, vfo);
		}
		LCD_UpdateQuery.FreqInfo = true;
	}
}

void PERIPH_ENCODER2_checkSwitch(void) {
	if(TRX.Locked) return;
	
	bool ENCODER2_SWNow = HAL_GPIO_ReadPin(ENC2_SW_GPIO_Port, ENC2_SW_Pin);
	if(ENCODER2_SWLast != ENCODER2_SWNow)
	{
		ENCODER2_SWLast = ENCODER2_SWNow;
		if (!ENCODER2_SWNow)
		{
			TRX_Time_InActive = 0;
		}
	}
}

void PERIPH_RF_UNIT_UpdateState(bool clean) //передаём значения в RF-UNIT
{
	bool hpf_lock = false;
	HAL_GPIO_WritePin(RFUNIT_RCLK_GPIO_Port, RFUNIT_RCLK_Pin, GPIO_PIN_RESET); //защёлка
	MINI_DELAY
	for (uint8_t registerNumber = 0; registerNumber < 16; registerNumber++) {
		HAL_GPIO_WritePin(RFUNIT_CLK_GPIO_Port, RFUNIT_CLK_Pin, GPIO_PIN_RESET); //клок данных
		MINI_DELAY
		HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_RESET); //данные
		MINI_DELAY
		if (!clean)
		{
			if (registerNumber == 0 && TRX_on_TX() && TRX_getMode(CurrentVFO()) != TRX_MODE_LOOPBACK) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //TX_AMP
			if (registerNumber == 1 && TRX.ATT) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //ATT_ON
			if (registerNumber == 2 && (!TRX.LPF || TRX_getFrequency(CurrentVFO()) > LPF_END)) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //LPF_OFF
			if (registerNumber == 3 && (!TRX.BPF || TRX_getFrequency(CurrentVFO()) < BPF_1_START)) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_OFF
			if (registerNumber == 4 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= BPF_0_START && TRX_getFrequency(CurrentVFO()) < BPF_0_END)
			{
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_0
				hpf_lock = true; //блокируем HPF для выделенного BPF фильтра УКВ
			}
			if (registerNumber == 5 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= BPF_1_START && TRX_getFrequency(CurrentVFO()) < BPF_1_END) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_1
			if (registerNumber == 6 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= BPF_2_START && TRX_getFrequency(CurrentVFO()) < BPF_2_END) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_2
			if (registerNumber == 7 && TRX_on_TX() && TRX_getMode(CurrentVFO()) != TRX_MODE_LOOPBACK) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //TX_RX

			//if(registerNumber==8) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			//if(registerNumber==9) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); // unused
			if (registerNumber == 10 && ((TRX_on_TX() && TRX_getMode(CurrentVFO()) != TRX_MODE_LOOPBACK) || TRX_Fan_Timeout > 0))
			{
				HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //FAN
				if (TRX_Fan_Timeout > 0) TRX_Fan_Timeout--;
			}
			if (registerNumber == 11 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= BPF_7_HPF && !hpf_lock) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_7_HPF
			if (registerNumber == 12 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= BPF_6_START && TRX_getFrequency(CurrentVFO()) < BPF_6_END) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_6
			if (registerNumber == 13 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= BPF_5_START && TRX_getFrequency(CurrentVFO()) < BPF_5_END) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_5
			if (registerNumber == 14 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= BPF_4_START && TRX_getFrequency(CurrentVFO()) < BPF_4_END) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_4
			if (registerNumber == 15 && TRX.BPF && TRX_getFrequency(CurrentVFO()) >= BPF_3_START && TRX_getFrequency(CurrentVFO()) < BPF_3_END) HAL_GPIO_WritePin(RFUNIT_DATA_GPIO_Port, RFUNIT_DATA_Pin, GPIO_PIN_SET); //BPF_3
		}
		MINI_DELAY
		HAL_GPIO_WritePin(RFUNIT_CLK_GPIO_Port, RFUNIT_CLK_Pin, GPIO_PIN_SET);
	}
	MINI_DELAY
	HAL_GPIO_WritePin(RFUNIT_CLK_GPIO_Port, RFUNIT_CLK_Pin, GPIO_PIN_RESET);
	MINI_DELAY
	HAL_GPIO_WritePin(RFUNIT_RCLK_GPIO_Port, RFUNIT_RCLK_Pin, GPIO_PIN_SET);
}

void PERIPH_InitFrontPanel(void)
{
	uint16_t test_value = PERIPH_ReadMCP3008_Value(0, AD1_CS_GPIO_Port, AD1_CS_Pin);
	if(test_value==65535)
	{
		FRONTPanel_MCP3008_1_Enabled = false;
		sendToDebug_strln("[ERR] Frontpanel MCP3008 - 1 not found, disabling...");
		LCD_showError("MCP3008 - 1 init error", true);
	}
	test_value = PERIPH_ReadMCP3008_Value(0, AD2_CS_GPIO_Port, AD2_CS_Pin);
	if(test_value==65535)
	{
		FRONTPanel_MCP3008_2_Enabled = false;
		sendToDebug_strln("[ERR] Frontpanel MCP3008 - 2 not found, disabling...");
		LCD_showError("MCP3008 - 1 init error", true);
	}
	PERIPH_ProcessFrontPanel();
	sendToDebug_strln("[OK] Frontpanel inited");
}

