witalis3/UA3REO-DDC-Transceiver/STM32/Src/peripheral.c
void PERIPH_ProcessFrontPanel(void)
{
	uint16_t mcp3008_value = 0;
	
	PERIPH_ENCODER2_checkSwitch();
	
	if(FRONTPanel_MCP3008_1_Enabled)
	{
		//MCP3008 - 1 (10bit - 1024values)
		mcp3008_value = PERIPH_ReadMCP3008_Value(0, AD1_CS_GPIO_Port, AD1_CS_Pin); // AB
		if(mcp3008_value < MCP3008_THRESHOLD)
			PERIPH_FrontPanel.key_ab = true; 
		else 
			PERIPH_FrontPanel.key_ab = false;
		
		mcp3008_value = PERIPH_ReadMCP3008_Value(1, AD1_CS_GPIO_Port, AD1_CS_Pin); // TUNE
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_tune = true; 
		else 
			PERIPH_FrontPanel.key_tune = false;
		
		mcp3008_value = PERIPH_ReadMCP3008_Value(2, AD1_CS_GPIO_Port, AD1_CS_Pin); // PREATT
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_preatt = true; 
		else 
			PERIPH_FrontPanel.key_preatt = false;
		
		mcp3008_value = PERIPH_ReadMCP3008_Value(3, AD1_CS_GPIO_Port, AD1_CS_Pin); // FAST
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_fast = true; 
		else 
			PERIPH_FrontPanel.key_fast = false;
		
		mcp3008_value = PERIPH_ReadMCP3008_Value(4, AD1_CS_GPIO_Port, AD1_CS_Pin); // MODE+
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_modep = true; 
		else 
			PERIPH_FrontPanel.key_modep = false;
		
		mcp3008_value = PERIPH_ReadMCP3008_Value(5, AD1_CS_GPIO_Port, AD1_CS_Pin); // MODE-
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_moden = true; 
		else 
			PERIPH_FrontPanel.key_moden = false;
		
		mcp3008_value = PERIPH_ReadMCP3008_Value(6, AD1_CS_GPIO_Port, AD1_CS_Pin); // BAND+
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_bandp = true; 
		else 
			PERIPH_FrontPanel.key_bandp = false;
		
		mcp3008_value = PERIPH_ReadMCP3008_Value(7, AD1_CS_GPIO_Port, AD1_CS_Pin); // BAND-
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_bandn = true; 
		else 
			PERIPH_FrontPanel.key_bandn = false;
		
		//A/B
		if (PERIPH_FrontPanel.key_ab_prev != PERIPH_FrontPanel.key_ab && PERIPH_FrontPanel.key_ab && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			TRX.current_vfo = !TRX.current_vfo;
			NeedSaveSettings = true;
			ReinitAudioFilters();
			LCD_redraw();
		}
		//TUNE
		if (PERIPH_FrontPanel.key_tune_prev != PERIPH_FrontPanel.key_tune && PERIPH_FrontPanel.key_tune && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			TRX_Tune = !TRX_Tune;
			TRX_ptt_hard = TRX_Tune;
			LCD_UpdateQuery.StatusInfoGUI = true;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
			TRX_Restart_Mode();
		}
		//PREATT
		if (PERIPH_FrontPanel.key_preatt_prev != PERIPH_FrontPanel.key_preatt && PERIPH_FrontPanel.key_preatt && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			if(!TRX.Preamp && !TRX.ATT)
			{
				TRX.Preamp = true;
				TRX.ATT = false;
			}
			else if(TRX.Preamp && !TRX.ATT)
			{
				TRX.Preamp = true;
				TRX.ATT = true;
			}
			else if(TRX.Preamp && TRX.ATT)
			{
				TRX.Preamp = false;
				TRX.ATT = true;
			}
			else if(!TRX.Preamp && TRX.ATT)
			{
				TRX.Preamp = false;
				TRX.ATT = false;
			}
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}
		//FAST
		if (PERIPH_FrontPanel.key_fast_prev != PERIPH_FrontPanel.key_fast && PERIPH_FrontPanel.key_fast && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			TRX.Fast = !TRX.Fast;
			LCD_UpdateQuery.TopButtons = true;
			NeedSaveSettings = true;
		}
		//MODE+
		if (PERIPH_FrontPanel.key_modep_prev != PERIPH_FrontPanel.key_modep && PERIPH_FrontPanel.key_modep && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			int8_t mode = CurrentVFO()->Mode;
			mode++;
			if (mode < 0) mode = TRX_MODE_COUNT - 2;
			if (mode >= (TRX_MODE_COUNT - 1)) mode = 0;
			TRX_setMode(mode, CurrentVFO());
			LCD_UpdateQuery.TopButtons = true;
		}
		//MODE-
		if (PERIPH_FrontPanel.key_moden_prev != PERIPH_FrontPanel.key_moden && PERIPH_FrontPanel.key_moden && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			int8_t mode = CurrentVFO()->Mode;
			mode--;
			if (mode < 0) mode = TRX_MODE_COUNT - 2;
			if (mode >= (TRX_MODE_COUNT - 1)) mode = 0;
			TRX_setMode(mode,CurrentVFO());
			LCD_UpdateQuery.TopButtons = true;
		}
		//BAND+
		if (PERIPH_FrontPanel.key_bandp_prev != PERIPH_FrontPanel.key_bandp && PERIPH_FrontPanel.key_bandp && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			band++;
			if (band >= BANDS_COUNT) band = 0;
			if (band < 0) band = BANDS_COUNT - 1;
			if (band >= 0) TRX_setFrequency(TRX.TRX_Saved_freq[band],CurrentVFO());
			LCD_UpdateQuery.TopButtons = true;
			LCD_UpdateQuery.FreqInfo = true;
		}
		//BAND-
		if (PERIPH_FrontPanel.key_bandn_prev != PERIPH_FrontPanel.key_bandn && PERIPH_FrontPanel.key_bandn && !TRX.Locked)
		{
			TRX_Time_InActive = 0;
			int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
			band--;
			if (band >= BANDS_COUNT) band = 0;
			if (band < 0) band = BANDS_COUNT - 1;
			if (band >= 0) TRX_setFrequency(TRX.TRX_Saved_freq[band],CurrentVFO());
			LCD_UpdateQuery.TopButtons = true;
			LCD_UpdateQuery.FreqInfo = true;
		}
		
		PERIPH_FrontPanel.key_ab_prev = PERIPH_FrontPanel.key_ab;
		PERIPH_FrontPanel.key_tune_prev = PERIPH_FrontPanel.key_tune;
		PERIPH_FrontPanel.key_preatt_prev = PERIPH_FrontPanel.key_preatt;
		PERIPH_FrontPanel.key_fast_prev = PERIPH_FrontPanel.key_fast;
		PERIPH_FrontPanel.key_modep_prev = PERIPH_FrontPanel.key_modep;
		PERIPH_FrontPanel.key_moden_prev = PERIPH_FrontPanel.key_moden;
		PERIPH_FrontPanel.key_bandp_prev = PERIPH_FrontPanel.key_bandp;
		PERIPH_FrontPanel.key_bandn_prev = PERIPH_FrontPanel.key_bandn;
	}
	
	if(FRONTPanel_MCP3008_2_Enabled)
	{
		//MCP3008 - 2 (10bit - 1024values)
		mcp3008_value = PERIPH_ReadMCP3008_Value(0, AD2_CS_GPIO_Port, AD2_CS_Pin); // MENU
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_menu = true; 
		else 
			PERIPH_FrontPanel.key_menu = false;
		
		mcp3008_value = PERIPH_ReadMCP3008_Value(1, AD2_CS_GPIO_Port, AD2_CS_Pin); // CLAR
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_clar = true; 
		else 
			PERIPH_FrontPanel.key_clar = false;
		
		mcp3008_value = PERIPH_ReadMCP3008_Value(2, AD2_CS_GPIO_Port, AD2_CS_Pin); // NOTCH
		if(mcp3008_value < MCP3008_THRESHOLD) 
			PERIPH_FrontPanel.key_notch = true; 
		else 
			PERIPH_FrontPanel.key_notch = false;
		
